Rahix/avr-device/vendor/atmega32a.atdf
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Sleep Enable" mask="0x80" name="SE"/>
          <bitfield caption="Sleep Mode Select" mask="0x70" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
          <bitfield caption="Interrupt Sense Control 1 Bits" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL2"/>
          <bitfield caption="Interrupt Sense Control 0 Bits" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL2"/>
        </register>
        <register caption="MCU Control And Status Register" name="MCUCSR" offset="0x54" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x51" size="1" mask="0xFF">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Special Function IO Register" name="SFIOR" offset="0x50" size="1" mask="0x07"/>
      </register-group>
      <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Standby" name="STDBY" value="0x06"/>
        <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
      </value-group>
      <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="1.0 MHz" name="1_0_MHz"/>
        <value value="0x01" caption="2.0 MHz" name="2_0_MHz"/>
        <value value="0x02" caption="4.0 MHz" name="4_0_MHz"/>
        <value value="0x03" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>

    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Read While Write secion read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="Two Wire Serial Interface" name="TWI">
      <register-group caption="Two Wire Serial Interface" name="TWI">
        <register caption="TWI Bit Rate register" name="TWBR" offset="0x20" size="1" mask="0xFF"/>
        <register caption="TWI Control Register" name="TWCR" offset="0x56" size="1" ocd-rw="R">
          <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
          <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
          <bitfield caption="TWI Start Condition Bit" mask="0x20" name="TWSTA"/>
          <bitfield caption="TWI Stop Condition Bit" mask="0x10" name="TWSTO"/>
          <bitfield caption="TWI Write Collition Flag" mask="0x08" name="TWWC"/>
          <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
          <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
        </register>
        <register caption="TWI Status Register" name="TWSR" offset="0x21" size="1">
          <bitfield caption="TWI Status" mask="0xF8" name="TWS" lsb="3"/>
          <bitfield caption="TWI Prescaler bits" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
        </register>
        <register caption="TWI Data register" name="TWDR" offset="0x23" size="1" mask="0xFF"/>
        <register caption="TWI (Slave) Address register" name="TWAR" offset="0x22" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="" name="COMM_TWI_PRESACLE">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="4" name="VAL_0x01" value="0x01"/>
        <value caption="16" name="VAL_0x02" value="0x02"/>
        <value caption="64" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="TQFPQFN44" caption="TQFPQFN44">
      <pin position="1" pad="PB5"/>
      <pin position="2" pad="PB6"/>
      <pin position="3" pad="PB7"/>
      <pin position="4" pad="RESET"/>
      <pin position="5" pad="VCC"/>
      <pin position="6" pad="GND"/>
      <pin position="7" pad="XTAL1"/>
      <pin position="8" pad="XTAL2"/>
      <pin position="9" pad="PD0"/>
      <pin position="10" pad="PD1"/>
      <pin position="11" pad="PD2"/>
      <pin position="12" pad="PD3"/>
      <pin position="13" pad="PD4"/>
      <pin position="14" pad="PD5"/>
      <pin position="15" pad="PD6"/>
      <pin position="16" pad="PD7"/>
      <pin position="17" pad="VCC"/>
      <pin position="18" pad="GND"/>
      <pin position="19" pad="PC0"/>
      <pin position="20" pad="PC1"/>
      <pin position="21" pad="PC2"/>
      <pin position="22" pad="PC3"/>
      <pin position="23" pad="PC4"/>
      <pin position="24" pad="PC5"/>
      <pin position="25" pad="PC6"/>
      <pin position="26" pad="PC7"/>
      <pin position="27" pad="AVCC"/>
      <pin position="28" pad="GND"/>
      <pin position="29" pad="AREF"/>
      <pin position="30" pad="PA7"/>
      <pin position="31" pad="PA6"/>
      <pin position="32" pad="PA5"/>
      <pin position="33" pad="PA4"/>
      <pin position="34" pad="PA3"/>
      <pin position="35" pad="PA2"/>
      <pin position="36" pad="PA1"/>
      <pin position="37" pad="PA0"/>
      <pin position="38" pad="VCC"/>
      <pin position="39" pad="GND"/>
      <pin position="40" pad="PB0"/>
      <pin position="41" pad="PB1"/>
      <pin position="42" pad="PB2"/>
      <pin position="43" pad="PB3"/>
      <pin position="44" pad="PB4"/>
    </pinout>
    <pinout name="PDIP40" caption="PDIP40">
      <pin position="1" pad="PB0"/>
      <pin position="2" pad="PB1"/>
      <pin position="3" pad="PB2"/>
      <pin position="4" pad="PB3"/>
      <pin position="5" pad="PB4"/>
      <pin position="6" pad="PB5"/>
      <pin position="7" pad="PB6"/>
      <pin position="8" pad="PB7"/>
      <pin position="9" pad="RESET"/>
      <pin position="10" pad="VCC"/>
      <pin position="11" pad="GND"/>
      <pin position="12" pad="XTAL1"/>
      <pin position="13" pad="XTAL2"/>
      <pin position="14" pad="PD0"/>
      <pin position="15" pad="PD1"/>
      <pin position="16" pad="PD2"/>
      <pin position="17" pad="PD3"/>
      <pin position="18" pad="PD4"/>
      <pin position="19" pad="PD5"/>
      <pin position="20" pad="PD6"/>
      <pin position="21" pad="PD7"/>
      <pin position="22" pad="PC0"/>
      <pin position="23" pad="PC1"/>
      <pin position="24" pad="PC2"/>
      <pin position="25" pad="PC3"/>
      <pin position="26" pad="PC4"/>
      <pin position="27" pad="PC5"/>
      <pin position="28" pad="PC6"/>
      <pin position="29" pad="PC7"/>
      <pin position="30" pad="AVCC"/>
      <pin position="31" pad="GND"/>
      <pin position="32" pad="AREF"/>
      <pin position="33" pad="PA7"/>
      <pin position="34" pad="PA6"/>
      <pin position="35" pad="PA5"/>
      <pin position="36" pad="PA4"/>
      <pin position="37" pad="PA3"/>
      <pin position="38" pad="PA2"/>
      <pin position="39" pad="PA1"/>
      <pin position="40" pad="PA0"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>